In [1]:
import numpy as np
import pandas as pd

# Creating a New Column

In [3]:
data = {"isim": ["ali", "elif", "fatma", "mehmet"], "boy": [1.70, 1.55, 1.60, 1.90], "kilo": [70,55,60,80]}
df = pd.DataFrame(data)
df

     isim   boy  kilo
0     ali  1.70    70
1    elif  1.55    55
2   fatma  1.60    60
3  mehmet  1.90    80

In [8]:
df["vki"] = round((df["kilo"] / df["boy"] ** 2), 2)

In [7]:
df

     isim   boy  kilo    vki
0     ali  1.70    70  24.22
1    elif  1.55    55  22.89
2   fatma  1.60    60  23.44
3  mehmet  1.90    80  22.16

# Conditional Selection

In [55]:
df = pd.DataFrame(np.random.randn(5,4), index="a b c d e".split(), columns=["A", "B", "C", "D"])
df

          A         B         C         D
a  0.155810 -0.305613 -0.739725 -0.523359
b -1.180582 -1.067505  3.605119 -0.791644
c  1.682472 -0.093191 -0.688696  0.306411
d -1.071492 -0.387478 -0.743863 -1.669998
e  0.183704  0.838177 -0.107634 -1.066050

In [56]:
df > 0

       A      B      C      D
a   True  False  False  False
b  False  False   True  False
c   True  False  False   True
d  False  False  False  False
e   True   True  False  False

In [57]:
df[df > 0]

          A         B         C         D
a  0.155810       NaN       NaN       NaN
b       NaN       NaN  3.605119       NaN
c  1.682472       NaN       NaN  0.306411
d       NaN       NaN       NaN       NaN
e  0.183704  0.838177       NaN       NaN

In [65]:
df[df < 0]

          A         B         C         D
a       NaN -0.305613 -0.739725 -0.523359
b -1.180582 -1.067505       NaN -0.791644
c       NaN -0.093191 -0.688696       NaN
d -1.071492 -0.387478 -0.743863 -1.669998
e       NaN       NaN -0.107634 -1.066050

In [66]:
df[df["A"] < 0] # A da 0 dan küçükleri döndürdü diğerlerinin değeri önemli olmadı

          A         B         C         D
b -1.180582 -1.067505  3.605119 -0.791644
d -1.071492 -0.387478 -0.743863 -1.669998

In [67]:
df[df["A"] > 0][["C"]] # # A da 0 dan büyük olan satırların C değerlerini döndürdü

          C
a -0.739725
c -0.688696
e -0.107634

In [70]:
df

          A         B         C         D
a  0.155810 -0.305613 -0.739725 -0.523359
b -1.180582 -1.067505  3.605119 -0.791644
c  1.682472 -0.093191 -0.688696  0.306411
d -1.071492 -0.387478 -0.743863 -1.669998
e  0.183704  0.838177 -0.107634 -1.066050

## &   -   and 
## |   -   or

In [71]:
df[(df["A"] > 0)  &  (df["B"] < 0)] # A da 0 dan büyük olacak ve B de 0 dan küçük olacak. ikisi aynı anda olmalı

          A         B         C         D
a  0.155810 -0.305613 -0.739725 -0.523359
c  1.682472 -0.093191 -0.688696  0.306411

In [72]:
df[(df["A"] > 0) | (df["B"] < 0)] # A da 0 büyük veya B de 0 dan küçük olanlar

          A         B         C         D
a  0.155810 -0.305613 -0.739725 -0.523359
b -1.180582 -1.067505  3.605119 -0.791644
c  1.682472 -0.093191 -0.688696  0.306411
d -1.071492 -0.387478 -0.743863 -1.669998
e  0.183704  0.838177 -0.107634 -1.066050

# Some Useful Methods with Titanic Dataset

In [92]:
import seaborn as sns

In [94]:
print(sns.get_dataset_names()) # seaborn'da gömülü dataframeler

['anagrams', 'anscombe', 'attention', 'brain_networks', 'car_crashes', 'diamonds', 'dots', 'dowjones', 'exercise', 'flights', 'fmri', 'geyser', 'glue', 'healthexp', 'iris', 'mpg', 'penguins', 'planets', 'seaice', 'taxis', 'tips', 'titanic']

In [95]:
df = sns.load_dataset("titanic")
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

## df.info()  & df.head() & df.tail() & df.sample()

In [98]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [102]:
df.head(5) # deafault ilk 5 satır

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [103]:
df.tail(5) # default olarak son 5 satır

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

In [101]:
df.sample(3) # rastgele 3 satır getirir

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
38,0,3,female,18.0,2,0,18.0000,S,Third,woman,False,NaN,Southampton,no,False
114,0,3,female,17.0,0,0,14.4583,C,Third,woman,False,NaN,Cherbourg,no,True
25,1,3,female,38.0,1,5,31.3875,S,Third,woman,False,NaN,Southampton,yes,False

In [104]:
df.shape

(891, 15)

## df.describe()
Count: Her sütundaki non-null (null olmayan) değerlerin sayısını verir.

Mean: Ortalama (aritmetik ortalama) değeri verir.

Standard Deviation: Standart sapmayı verir, yani değerlerin ortalama etrafındaki yayılımını gösteren bir ölçüdür.

Minimum: En küçük değeri verir.

25th Percentile: Alt çeyrek yüzdeğini verir, yani değerlerin %25'lik kısmının altında kalan değeri verir.

Median (50th Percentile): Medyan değeri verir, yani değerlerin ortanca değerini verir.

75th Percentile: Üst çeyrek yüzdeğini verir, yani değerlerin %75'lik kısmının altında kalan değeri verir.

Maximum: En büyük değeri verir.

Unique: Benzersiz (farklı) değerlerin sayısını verir.

Top: En sık tekrar eden değeri verir.

Frequency: En sık tekrar eden değerin kaç kez tekrar ettiğini verir.

In [105]:
df.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [106]:
df.describe().transpose()

          count       mean        std   min      25%      50%   75%       max
survived  891.0   0.383838   0.486592  0.00   0.0000   0.0000   1.0    1.0000
pclass    891.0   2.308642   0.836071  1.00   2.0000   3.0000   3.0    3.0000
age       714.0  29.699118  14.526497  0.42  20.1250  28.0000  38.0   80.0000
sibsp     891.0   0.523008   1.102743  0.00   0.0000   0.0000   1.0    8.0000
parch     891.0   0.381594   0.806057  0.00   0.0000   0.0000   0.0    6.0000
fare      891.0  32.204208  49.693429  0.00   7.9104  14.4542  31.0  512.3292

In [107]:
df.describe().T #transpose() kısaltma

          count       mean        std   min      25%      50%   75%       max
survived  891.0   0.383838   0.486592  0.00   0.0000   0.0000   1.0    1.0000
pclass    891.0   2.308642   0.836071  1.00   2.0000   3.0000   3.0    3.0000
age       714.0  29.699118  14.526497  0.42  20.1250  28.0000  38.0   80.0000
sibsp     891.0   0.523008   1.102743  0.00   0.0000   0.0000   1.0    8.0000
parch     891.0   0.381594   0.806057  0.00   0.0000   0.0000   0.0    6.0000
fare      891.0  32.204208  49.693429  0.00   7.9104  14.4542  31.0  512.3292

In [109]:
df.describe(include="O").T # sadece object olanların ölçümlerini getirdi

            count unique          top freq
sex           891      2         male  577
embarked      889      3            S  644
who           891      3          man  537
embark_town   889      3  Southampton  644
alive         891      2           no  549

In [110]:
df.describe(include="all").T # bütün verileri getirdi

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
survived,891.0,NaN,NaN,NaN,0.383838,0.486592,0.0,0.0,0.0,1.0,1.0
pclass,891.0,NaN,NaN,NaN,2.308642,0.836071,1.0,2.0,3.0,3.0,3.0
sex,891,2,male,577,NaN,NaN,NaN,NaN,NaN,NaN,NaN
age,714.0,NaN,NaN,NaN,29.699118,14.526497,0.42,20.125,28.0,38.0,80.0
sibsp,891.0,NaN,NaN,NaN,0.523008,1.102743,0.0,0.0,0.0,1.0,8.0
parch,891.0,NaN,NaN,NaN,0.381594,0.806057,0.0,0.0,0.0,0.0,6.0
fare,891.0,NaN,NaN,NaN,32.204208,49.693429,0.0,7.9104,14.4542,31.0,512.3292
embarked,889,3,S,644,NaN,NaN,NaN,NaN,NaN,NaN,NaN
class,891,3,Third,491,NaN,NaN,NaN,NaN,NaN,NaN,NaN
who,891,3,man,537,NaN,NaN,NaN,NaN,NaN,NaN,NaN
adult_male,891,2,True,537,NaN,NaN,NaN,NaN,NaN,NaN,NaN
deck,203,7,C,59,NaN,NaN,NaN,NaN,NaN,NaN,NaN
embark_town,889,3,Southampton,644,NaN,NaN,NaN,NaN,NaN,NaN,NaN
alive,891,2,no,549,NaN,NaN,NaN,NaN,NaN,NaN,NaN
alone,891,2,True,537,NaN,NaN,NaN,NaN,NaN,NaN,NaN

## df.corr()
"df.corr()" kodu, bir Pandas veri çerçevesinde bulunan sayısal sütunlar arasındaki Pearson korelasyon katsayılarını hesaplayan bir metoddur. Pearson korelasyonu, iki sürekli değişken arasındaki doğrusal ilişkiyi ölçen bir istatistiksel metriktir. Korelasyon katsayısı -1 ile 1 arasında bir değer alabilir ve iki değişken arasındaki ilişkinin yönünü (pozitif, negatif veya ilişkisiz) ve gücünü ifade eder.

"Df.corr()" kodu, veri çerçevesinde bulunan sayısal sütunlar arasındaki Pearson korelasyon katsayılarını bir korelasyon matrisi olarak döndürür. Korelasyon matrisi, veri çerçevesindeki her bir sayısal sütunun diğer sayısal sütunlarla olan korelasyonunu gösterir. Matrisin iki boyutlu yapısı, satır ve sütunlar arasındaki korelasyonu temsil eder. Matrisin çapraz köşeleri genellikle aynı sütunlar arasındaki korelasyonlar olup, diagonali ise sütunların kendi kendine korelasyonlarını içerir.

"Df.corr()" metodu, veri analitiği, keşifsel veri analitiği ve makine öğrenimi modellerinde değişkenler arasındaki ilişkileri değerlendirmek, çoklu değişken analizleri yapmak, özellik seçimi yapmak gibi birçok uygulamada kullanılabilir. Korelasyon katsayıları, değişkenler arasındaki ilişkileri anlamak ve modelleme süreçlerinde daha iyi kararlar vermek için değerli bir araçtır.

In [111]:
df.corr()

C:\Users\ertek\AppData\Local\Temp\ipykernel_14996\1134722465.py:1: FutureWarning: The default value of numeric_only in DataFrame.corr is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.corr()

,survived,pclass,age,sibsp,parch,fare,adult_male,alone
survived,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307,-0.557080,-0.203367
pclass,-0.338481,1.000000,-0.369226,0.083081,0.018443,-0.549500,0.094035,0.135207
age,-0.077221,-0.369226,1.000000,-0.308247,-0.189119,0.096067,0.280328,0.198270
sibsp,-0.035322,0.083081,-0.308247,1.000000,0.414838,0.159651,-0.253586,-0.584471
parch,0.081629,0.018443,-0.189119,0.414838,1.000000,0.216225,-0.349943,-0.583398
fare,0.257307,-0.549500,0.096067,0.159651,0.216225,1.000000,-0.182024,-0.271832
adult_male,-0.557080,0.094035,0.280328,-0.253586,-0.349943,-0.182024,1.000000,0.404744
alone,-0.203367,0.135207,0.198270,-0.584471,-0.583398,-0.271832,0.404744,1.000000

In [112]:
import warnings

warnings.filterwarnings("ignore") # bu tür uyarıları görmemek için

In [113]:
df.corr()

,survived,pclass,age,sibsp,parch,fare,adult_male,alone
survived,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307,-0.557080,-0.203367
pclass,-0.338481,1.000000,-0.369226,0.083081,0.018443,-0.549500,0.094035,0.135207
age,-0.077221,-0.369226,1.000000,-0.308247,-0.189119,0.096067,0.280328,0.198270
sibsp,-0.035322,0.083081,-0.308247,1.000000,0.414838,0.159651,-0.253586,-0.584471
parch,0.081629,0.018443,-0.189119,0.414838,1.000000,0.216225,-0.349943,-0.583398
fare,0.257307,-0.549500,0.096067,0.159651,0.216225,1.000000,-0.182024,-0.271832
adult_male,-0.557080,0.094035,0.280328,-0.253586,-0.349943,-0.182024,1.000000,0.404744
alone,-0.203367,0.135207,0.198270,-0.584471,-0.583398,-0.271832,0.404744,1.000000

## .value_count()
 bir sütundaki benzersiz değerlerin sayısını ve her bir değerin kaç kez tekrar ettiğini hesaplayan yada oranlarını görebiliriz

In [124]:
df.loc[:,"survived"]

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: survived, Length: 891, dtype: int64

In [125]:
df.survived.value_counts() # bü sütunda 0 ve 1 değerleri var ve kaç kere tekrar ettikleri

0    549
1    342
Name: survived, dtype: int64

In [126]:
df.survived.value_counts(normalize=True) # # bü sütunda 0 ve 1 değerleri var ve oranları

0    0.616162
1    0.383838
Name: survived, dtype: float64

## .unique() & .nunique()

In [127]:
df.embark_town.unique() # bü sütundaki unique değerleri gördük

array(['Southampton', 'Cherbourg', 'Queenstown', nan], dtype=object)

In [128]:
df.survived.unique()

array([0, 1], dtype=int64)

In [131]:
df.embark_town.nunique() # bu sütundaki unique değerlerin sayısı

3

# drop()
drop() yöntemi, bir Pandas DataFrame'den belirtilen satır veya sütunu kaldırmak için kullanılır. 

Eğer sütun kaldırılacaksa, axis='columns' parametresi kullanılır ve belirtilen sütun kaldırılır. 

Benzer şekilde, eğer bir satır kaldırılacaksa, axis='index' parametresi kullanılır ve belirtilen satır kaldırılır.

Bu yöntem, DataFrame'den istenmeyen verileri kaldırmak ve veri manipülasyonu yapmak için sıkça kullanılır.

In [9]:
df

     isim   boy  kilo    vki
0     ali  1.70    70  24.22
1    elif  1.55    55  22.89
2   fatma  1.60    60  23.44
3  mehmet  1.90    80  22.16

In [10]:
df.drop("vki", axis=1) #kalıcı olarak düşmez

     isim   boy  kilo
0     ali  1.70    70
1    elif  1.55    55
2   fatma  1.60    60
3  mehmet  1.90    80

In [12]:
df.drop("vki", axis=1, inplace=True) #kalıcı olarak düştü
df

     isim   boy  kilo
0     ali  1.70    70
1    elif  1.55    55
2   fatma  1.60    60
3  mehmet  1.90    80

In [11]:
df.drop(3) # default axis = 0 dır

    isim   boy  kilo    vki
0    ali  1.70    70  24.22
1   elif  1.55    55  22.89
2  fatma  1.60    60  23.44

# .loc[] & .iloc[]
loc: label-based

iloc: integer position-based

loc, "location"ın kısaltmasıdır ve satır ve sütun adlarına göre veriye erişmeyi sağlar.

loc, satır ve sütun etiketleri kullanarak belirli bir konumda bulunan veriye erişmek için kullanılır.

iloc, "integer location"ın kısaltmasıdır ve satır ve sütun numaralarına göre veriye erişmeyi sağlar.

iloc, satır ve sütun numaralarını kullanarak belirli bir konumda bulunan veriye erişmek için kullanılır.

1- Etiket veya dizin bağımsızlığı:Geleneksel indexleme yöntemleri, indekslerdeki değişikliklerden etkilenirken, "loc" ve "iloc" yöntemleri, konumlarına göre seçim yaparlar. Bu nedenle, veri setindeki indekslerdeki değişiklikler "loc" ve "iloc" yöntemleriyle yapılan seçimlerde bir sorun yaratmaz.

2-Hızlı performans: "iloc" fonksiyonu, sadece satır ve sütun dizinleri kullanarak veri seçimi yapar, bu nedenle loc fonksiyonuna göre daha hızlı çalışır. Bu özellik, büyük veri kümelerinde veya performans açısından kritik uygulamalarda faydalıdır.

3-Esneklik: Geleneksel indexleme yöntemleri, sadece sıfırdan başlayan, ardışık tam sayılar kullanarak indexlemeye izin verir. "loc" ve "iloc" yöntemleri ise etiket veya dizin değerlerine dayanır ve daha esnek bir seçim yapma imkanı sağlar. "loc" ve "iloc" fonksiyonları, veri çerçevesindeki satır ve sütunların bir arada kullanımına izin verir. Örneğin, belirli bir sütunda belirli bir satırdaki veriyi seçmek için hem satır hem de sütun etiketlerini veya dizinlerini kullanabilirsiniz. Bu esneklik, veri işleme işlemlerinde kullanışlıdır.

4-Daha okunaklı kod: "loc" ve "iloc" fonksiyonları, kodun daha okunaklı hale gelmesine yardımcı olur.

In [13]:
data = np.arange(20).reshape(5,4)

df = pd.DataFrame(data=data, columns=["col1", "col2", "col3", "col4"], index=range(1,6))

df

   col1  col2  col3  col4
1     0     1     2     3
2     4     5     6     7
3     8     9    10    11
4    12    13    14    15
5    16    17    18    19

In [16]:
df.loc[[1]] # label isimlerine göre getirir

   col1  col2  col3  col4
1     0     1     2     3

In [21]:
df.iloc[[0]] # index lere göre getirir

   col1  col2  col3  col4
1     0     1     2     3

In [18]:
df[["col1"]]

   col1
1     0
2     4
3     8
4    12
5    16

In [24]:
df.iloc[: , 0]

1     0
2     4
3     8
4    12
5    16
Name: col1, dtype: int32

In [25]:
df.loc[2:5]

   col1  col2  col3  col4
2     4     5     6     7
3     8     9    10    11
4    12    13    14    15
5    16    17    18    19

In [26]:
df.iloc[2:5]

   col1  col2  col3  col4
3     8     9    10    11
4    12    13    14    15
5    16    17    18    19

In [27]:
df.index = "a b c d e".split()   # ["a", "b", "c", "d", "e"]

In [28]:
df

   col1  col2  col3  col4
a     0     1     2     3
b     4     5     6     7
c     8     9    10    11
d    12    13    14    15
e    16    17    18    19

In [30]:
df.loc["b": "d"]

   col1  col2  col3  col4
b     4     5     6     7
c     8     9    10    11
d    12    13    14    15

In [35]:
df.iloc[1:4]

   col1  col2  col3  col4
b     4     5     6     7
c     8     9    10    11
d    12    13    14    15

In [47]:
df.loc[["b"], ["col2"]]

   col2
b     5

In [48]:
df.iloc[[1], [1]]

   col2
b     5

In [49]:
df.loc["d": "e"]["col3"]

d    14
e    18
Name: col3, dtype: int32

In [51]:
df.loc["d": "e", ["col3"]]

   col3
d    14
e    18

In [53]:
df.loc[["a", "d", "e"], ["col3"]]

   col3
a     2
d    14
e    18

# reset_index()   &  set_index
reset_index(), DataFrame indeksini sıfırlar ve bunun yerine default hali kullanır.

set_index(), DataFrame'in belirtilen bir sütununu veya sütunlarını, DataFrame'in yeni bir indeksi olarak ayarlar.

In [73]:
df

          A         B         C         D
a  0.155810 -0.305613 -0.739725 -0.523359
b -1.180582 -1.067505  3.605119 -0.791644
c  1.682472 -0.093191 -0.688696  0.306411
d -1.071492 -0.387478 -0.743863 -1.669998
e  0.183704  0.838177 -0.107634 -1.066050

In [74]:
df.reset_index() # kalıcı olmaz ve eski indeksleri saklar

  index         A         B         C         D
0     a  0.155810 -0.305613 -0.739725 -0.523359
1     b -1.180582 -1.067505  3.605119 -0.791644
2     c  1.682472 -0.093191 -0.688696  0.306411
3     d -1.071492 -0.387478 -0.743863 -1.669998
4     e  0.183704  0.838177 -0.107634 -1.066050

In [75]:
df

          A         B         C         D
a  0.155810 -0.305613 -0.739725 -0.523359
b -1.180582 -1.067505  3.605119 -0.791644
c  1.682472 -0.093191 -0.688696  0.306411
d -1.071492 -0.387478 -0.743863 -1.669998
e  0.183704  0.838177 -0.107634 -1.066050

In [76]:
df.reset_index(drop=True, inplace=True) # eski indeksleri düşürdük ve bu işlemi kalıcı hale getirdik

In [77]:
df

          A         B         C         D
0  0.155810 -0.305613 -0.739725 -0.523359
1 -1.180582 -1.067505  3.605119 -0.791644
2  1.682472 -0.093191 -0.688696  0.306411
3 -1.071492 -0.387478 -0.743863 -1.669998
4  0.183704  0.838177 -0.107634 -1.066050

In [78]:
df.set_index("C") # kalıcı olmaz

                  A         B         D
C
-0.739725  0.155810 -0.305613 -0.523359
 3.605119 -1.180582 -1.067505 -0.791644
-0.688696  1.682472 -0.093191  0.306411
-0.743863 -1.071492 -0.387478 -1.669998
-0.107634  0.183704  0.838177 -1.066050

In [79]:
df

          A         B         C         D
0  0.155810 -0.305613 -0.739725 -0.523359
1 -1.180582 -1.067505  3.605119 -0.791644
2  1.682472 -0.093191 -0.688696  0.306411
3 -1.071492 -0.387478 -0.743863 -1.669998
4  0.183704  0.838177 -0.107634 -1.066050

In [80]:
df.set_index("C", inplace=True) # kalıcı hale geldi
df

                  A         B         D
C
-0.739725  0.155810 -0.305613 -0.523359
 3.605119 -1.180582 -1.067505 -0.791644
-0.688696  1.682472 -0.093191  0.306411
-0.743863 -1.071492 -0.387478 -1.669998
-0.107634  0.183704  0.838177 -1.066050

In [88]:
df.reset_index(inplace=True)
df

          C         A         B         D
0 -0.739725  0.155810 -0.305613 -0.523359
1  3.605119 -1.180582 -1.067505 -0.791644
2 -0.688696  1.682472 -0.093191  0.306411
3 -0.743863 -1.071492 -0.387478 -1.669998
4 -0.107634  0.183704  0.838177 -1.066050

In [91]:
df = df[["A", "B", "C", "D"]] # tekrar colum isimlerini sıralamak için böyle bir yöntem izledik
df

          A         B         C         D
0  0.155810 -0.305613 -0.739725 -0.523359
1 -1.180582 -1.067505  3.605119 -0.791644
2  1.682472 -0.093191 -0.688696  0.306411
3 -1.071492 -0.387478 -0.743863 -1.669998
4  0.183704  0.838177 -0.107634 -1.066050

# df.agg() & agg methods
aggregate() & agg(); bir sütuna veya sütunlara göre gruplandırılmış bir veri kümesinde farklı işlevlerin (örneğin, mean, sum, max) uygulanması için kullanılır.

[aggregate](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.aggregate.html),
[agg](https://pandas.pydata.org/pandas-docs/version/0.23/generated/pandas.core.groupby.DataFrameGroupBy.agg.html),
[SOURCE01](https://www.shanelynn.ie/summarising-aggregation-and-grouping-data-in-python-pandas/),
[SOURCE02](https://www.analyticsvidhya.com/blog/2020/03/groupby-pandas-aggregating-data-python/)

Pandas'ın aggregation yöntemleri, belirli bir veri kümesi üzerinde işlemler gerçekleştirerek bir sonuç döndürür. 

Bu yöntemler, bir veri kümesindeki değerleri toplama, ortalama alma, en büyük veya en küçük değeri bulma gibi farklı işlemleri gerçekleştirir. 


Pandas'ın aggregation yöntemlerinden bazıları şunlardır:

**sum():** Belirtilen sütunda yer alan tüm değerlerin toplamını döndürür.

**mean():** Belirtilen sütunda yer alan tüm değerlerin ortalamasını döndürür.

**median():** Gruplanmış verilerin medyanını hesaplar.

**mode()** Belirtilen sütunda en çok tekrar eden değerleri döndürür.

**max():** Belirtilen sütunda yer alan en büyük değeri döndürür.

**min():** Belirtilen sütunda yer alan en küçük değeri döndürür.

**count():** Belirtilen sütunda yer alan toplam değer sayısını döndürür.

**std():** Belirtilen sütunda yer alan değerlerin standart sapmasını döndürür.

**var():** Belirtilen sütunda yer alan değerlerin varyansını döndürür.

**describe():** Gruplanmış verilerin istatistiksel özetini hesaplar.

**idxmin():** Belirtilen eksen boyunca minimum değeri içeren ilk indeksi döndürür.

**idxmax():** Belirtilen eksen boyunca maksimum değeri içeren ilk indeksi döndürür.

**corr():** Sütunlar  arasındaki korelasyonu, NA/null değerleri hariç tutarak hesaplar.

Bu yöntemler, bir DataFrame veya Series üzerinde kullanılabilir ve istenilen sütun veya satırlarda işlem yapılabilir. 

Pandas'ın aggregation yöntemleri, verileri hızlı ve etkili bir şekilde analiz etmek için çok kullanışlıdır.

[Pandas Official Documentation](https://pandas.pydata.org/docs/reference/frame.html)

In [157]:
dt = {'Company':['Amazon', 'Amazon', 'OpenAI', 'OpenAI', 'Amazon', 'OpenAI', 'Amazon', 'OpenAI'],
        'Department':['IT', 'HR', 'IT', 'HR', 'IT', 'HR', 'HR', 'IT'],
        'Person':['Ahmet', 'Ece', 'Fatma', 'Mehmet', 'Zeynep', 'Ali', 'Yusuf', 'Elif'],
        'Age':[32, 26, 35, 40, 25, 38, 30, 28],
        'Sales':[180, 160, 150, 180, 240, 200, 220, 160]}

df = pd.DataFrame(dt)
df

  Company Department  Person  Age  Sales
0  Amazon         IT   Ahmet   32    180
1  Amazon         HR     Ece   26    160
2  OpenAI         IT   Fatma   35    150
3  OpenAI         HR  Mehmet   40    180
4  Amazon         IT  Zeynep   25    240
5  OpenAI         HR     Ali   38    200
6  Amazon         HR   Yusuf   30    220
7  OpenAI         IT    Elif   28    160

In [158]:
df.agg([sum, min])

,Company,Department,Person,Age,Sales
sum,AmazonAmazonOpenAIOpenAIAmazonOpenAIAmazonOpenAI,ITHRITHRITHRHRIT,AhmetEceFatmaMehmetZeynepAliYusufElif,254,1490
min,Amazon,HR,Ahmet,25,150

In [159]:
df.loc[:, ["Age", "Sales"]].agg([sum]) # belirli sütunlara uyguladım

     Age  Sales
sum  254   1490

In [160]:
df.agg({"Age": sum, "Sales" : [min]}) # sütunlara ayrı ayrı işlemler atadık

       Age  Sales
sum  254.0    NaN
min    NaN  150.0

In [161]:
df.agg({"Age": [sum, np.mean], "Sales" : [min, max]})

         Age  Sales
sum   254.00    NaN
mean   31.75    NaN
min      NaN  150.0
max      NaN  240.0

In [162]:
df

  Company Department  Person  Age  Sales
0  Amazon         IT   Ahmet   32    180
1  Amazon         HR     Ece   26    160
2  OpenAI         IT   Fatma   35    150
3  OpenAI         HR  Mehmet   40    180
4  Amazon         IT  Zeynep   25    240
5  OpenAI         HR     Ali   38    200
6  Amazon         HR   Yusuf   30    220
7  OpenAI         IT    Elif   28    160

In [163]:
df.Sales.min()

150

In [165]:
df.Sales.idxmax() # max Sales olanın indexisini döndürdü

4

In [167]:
df.Sales.idxmin() # min Sales olanın indexisini döndürdü

2

# .groupby()
groupby(); bir veri setindeki belirli bir sütuna göre gruplama yapmak için kullanılır ve aggregation metodlarıyla beraber kullanılır

Bu işlev, verileri gruplara ayırmak ve bu gruplar üzerinde çeşitli işlemler yapmak için kullanılır.

Örneğin, bir veri kümesinde müşterilerin isimleri, yaşları ve satın aldıkları ürünler yer alıyor olabilir. groupby() işlevi kullanarak, müşterilerin satın aldıkları ürüne göre gruplandırabilir ve her ürün için ortalama yaşlarını bulabilirsiniz.

[Source01](https://towardsdatascience.com/all-pandas-groupby-you-should-know-for-grouping-data-and-performing-operations-2a8ec1327b5),
[Source02](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.groupby.html),
[Source03](https://naomi-fridman.medium.com/pandas-groupby-explained-with-titanic-6a1c47eb8182)

In [145]:
df

  Company Department  Person  Age  Sales
0  Amazon         IT   Ahmet   32    180
1  Amazon         HR     Ece   26    160
2  OpenAI         IT   Fatma   35    150
3  OpenAI         HR  Mehmet   40    180
4  Amazon         IT  Zeynep   25    240
5  OpenAI         HR     Ali   38    200
6  Amazon         HR   Yusuf   30    220
7  OpenAI         IT    Elif   28    160

In [146]:
df.groupby("Company") # bu şekilde object döndürür. bir işlem uygulamadık

In [147]:
df.groupby("Company").mean() # gruplayıp, grup ortalamalarına baktık. sadece numeric satırlara uyguladı

           Age  Sales
Company
Amazon   28.25  200.0
OpenAI   35.25  172.5

In [148]:
df.groupby("Company")[["Sales"]].mean() #sadece Sales sütununa uyguladık

         Sales
Company
Amazon   200.0
OpenAI   172.5

In [149]:
df.groupby("Company").count()

         Department  Person  Age  Sales
Company
Amazon            4       4    4      4
OpenAI            4       4    4      4

In [150]:
df.groupby("Company")[["Company"]].count()

         Company
Company
Amazon         4
OpenAI         4

In [151]:
df.Company.value_counts()

Amazon    4
OpenAI    4
Name: Company, dtype: int64

In [152]:
df.groupby(["Company", "Department"]).mean()

                     Age  Sales
Company Department
Amazon  HR          28.0  190.0
        IT          28.5  210.0
OpenAI  HR          39.0  190.0
        IT          31.5  155.0

In [182]:
# Bölümlere (departmanlara) göre toplam sales tutarlarını hesaplamak:

df.groupby('Department').sum()[['Sales']]

            Sales
Department
HR            760
IT            730

In [175]:
compare = df.groupby(["Company"]) # bir değişkene atayabiliriz

In [177]:
compare.mean()

           Age  Sales
Company
Amazon   28.25  200.0
OpenAI   35.25  172.5

In [178]:
compare.corr()

                    Age     Sales
Company
Amazon  Age    1.000000 -0.221032
        Sales -0.221032  1.000000
OpenAI  Age    1.000000  0.593934
        Sales  0.593934  1.000000

# filter()
filter(): Verileri belirli bir koşula göre filtreler.

belirli bir koşulu karşılayan satırları veya sütunları seçmek için kullanılabilir.

Parametreler: df.filter(items=None, like=None, regex=None, axis=None)

items: Bir liste veya dizin nesnesi olarak belirtilen sütun adlarını içeren bir liste. Sadece bu sütunlar seçilir.

like: String olarak belirtilen bir deseni içeren sütun adları seçilir.

regex: Regex (düzenli ifade) olarak belirtilen bir deseni içeren sütun adları seçilir.

axis: 'columns' veya 1 olarak belirtilirse sütunlarda filtreleme yapar, 'index' veya 0 olarak belirtilirse satırlarda filtreleme yapar.

[Pandas Official Documentation](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.filter.html),
[SOURCE01](https://www.sharpsightlabs.com/blog/pandas-filter/),
[SOURCE02](https://appdividend.com/2020/03/19/pandas-filter-pandas-dataframe-filter-in-python-example/)

In [179]:
df

  Company Department  Person  Age  Sales
0  Amazon         IT   Ahmet   32    180
1  Amazon         HR     Ece   26    160
2  OpenAI         IT   Fatma   35    150
3  OpenAI         HR  Mehmet   40    180
4  Amazon         IT  Zeynep   25    240
5  OpenAI         HR     Ali   38    200
6  Amazon         HR   Yusuf   30    220
7  OpenAI         IT    Elif   28    160

In [184]:
df.filter(['Company', 'Age'])

  Company  Age
0  Amazon   32
1  Amazon   26
2  OpenAI   35
3  OpenAI   40
4  Amazon   25
5  OpenAI   38
6  Amazon   30
7  OpenAI   28

In [187]:
df.filter(like='a') # sütun adlarından "a" kelimesini içeren sütunlar seçilecektir.

  Company Department  Sales
0  Amazon         IT    180
1  Amazon         HR    160
2  OpenAI         IT    150
3  OpenAI         HR    180
4  Amazon         IT    240
5  OpenAI         HR    200
6  Amazon         HR    220
7  OpenAI         IT    160

In [188]:
df.filter(regex='^C') # Bu örnekte sütun adlarından "C" harfi ile başlayan sütunlar seçilecektir.

  Company
0  Amazon
1  Amazon
2  OpenAI
3  OpenAI
4  Amazon
5  OpenAI
6  Amazon
7  OpenAI

In [196]:
df.filter(like="3", axis=0)

  Company Department  Person  Age  Sales
3  OpenAI         HR  Mehmet   40    180

## groupby - filter

In [197]:
df.groupby("Company").mean()

           Age  Sales
Company
Amazon   28.25  200.0
OpenAI   35.25  172.5

In [202]:
df.groupby("Company").filter(lambda x : x["Age"].mean() < 30) 
# grup yaş ortalaması 30 un altında ise True olur ve o değerler döner

  Company Department  Person  Age  Sales
0  Amazon         IT   Ahmet   32    180
1  Amazon         HR     Ece   26    160
4  Amazon         IT  Zeynep   25    240
6  Amazon         HR   Yusuf   30    220

In [201]:
(lambda x : x["Age"].mean() < 30)(df.groupby("Company"))

Company
Amazon     True
OpenAI    False
Name: Age, dtype: bool

# transform()

DataFrame veya Series nesnelerinde gruplama işlemleri sonrası verileri dönüştürmek için kullanılan bir fonksiyondur. "transform()" fonksiyonu, her bir grup için aynı boyutta bir sonuç üretir ve orijinal veri yapısını korur. Gruplanmış veri üzerinde herhangi bir işlem yapabilir ve sonuçları orijinal veri yapısına uygun bir şekilde dönüştürebilir.

transform(), bir pandas DataFrame ya da Serisi'ndeki verileri değiştirmek veya dönüştürmek için kullanılan bir yöntemdir. 

Belirtilen işlevi uygular ve sonucu yeni bir Seri veya DataFrame olarak döndürür.

Özellikle gruplama işlemleri ile birlikte kullanıldığında oldukça yararlıdır.

agg. metodlarla kullanılabilir

[SOUREC01](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.transform.html) & [SOURCE02](https://www.analyticsvidhya.com/blog/2020/03/understanding-transform-function-python/)

In [203]:
df

  Company Department  Person  Age  Sales
0  Amazon         IT   Ahmet   32    180
1  Amazon         HR     Ece   26    160
2  OpenAI         IT   Fatma   35    150
3  OpenAI         HR  Mehmet   40    180
4  Amazon         IT  Zeynep   25    240
5  OpenAI         HR     Ali   38    200
6  Amazon         HR   Yusuf   30    220
7  OpenAI         IT    Elif   28    160

In [204]:
df_num = df.iloc[:, 3:]

In [205]:
df_num

   Age  Sales
0   32    180
1   26    160
2   35    150
3   40    180
4   25    240
5   38    200
6   30    220
7   28    160

In [207]:
df_num.Sales.transform(np.sqrt)

0    13.416408
1    12.649111
2    12.247449
3    13.416408
4    15.491933
5    14.142136
6    14.832397
7    12.649111
Name: Sales, dtype: float64

In [208]:
df_num.Sales.agg(np.sqrt)

0    13.416408
1    12.649111
2    12.247449
3    13.416408
4    15.491933
5    14.142136
6    14.832397
7    12.649111
Name: Sales, dtype: float64

## groupby - transform

In [209]:
df.groupby("Company")["Age"].mean()

Company
Amazon    28.25
OpenAI    35.25
Name: Age, dtype: float64

In [210]:
df.groupby("Company")[["Age"]].transform(np.mean) # her satıra grubunun ortalamasını yazdı

     Age
0  28.25
1  28.25
2  35.25
3  35.25
4  28.25
5  35.25
6  28.25
7  35.25

# apply() - applymap() - map()

apply(): DataFrame veya Seri üzerinde bir satır veya sütun boyunca bir işlem yapmak için kullanılır.

applymap(): DataFrame'in tamamı üzerinde öğe bazında işlem için kullanılır.

map(): Yalnızca Seri lerde kullanılabilir ve Seri nin her bir elemanına uygulanacak bir işlem için kullanılır.

[apply](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.apply.html)
[applymap](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.applymap.html)
[map](https://pandas.pydata.org/docs/reference/api/pandas.Series.map.html)

[SOUREC01](https://www.geeksforgeeks.org/python-pandas-apply/), 
[SOURCE02](https://www.datacamp.com/community/tutorials/pandas-apply),
[SOURCE03](https://sparkbyexamples.com/pandas/pandas-apply-function-usage-examples/),
[SOURCE04](https://realpython.com/python-map-function/#:~:text=Python's%20map()%20is%20a,them%20into%20a%20new%20iterable.),
[SOURCE05](https://www.w3resource.com/pandas/series/series-map.php),
[SOURCE06](https://towardsdatascience.com/introduction-to-pandas-apply-applymap-and-map-5d3e044e93ff#:~:text=apply()%20is%20used%20to,a%20Series%20with%20another%20value.),
[SOURCE07](https://stackoverflow.com/questions/19798153/difference-between-map-applymap-and-apply-methods-in-pandas) &
[SOURCE08](https://medium.com/@akaivdo/how-to-use-map-apply-applymap-methods-in-pandas-ddde5f2140bd)

In [212]:
df

  Company Department  Person  Age  Sales
0  Amazon         IT   Ahmet   32    180
1  Amazon         HR     Ece   26    160
2  OpenAI         IT   Fatma   35    150
3  OpenAI         HR  Mehmet   40    180
4  Amazon         IT  Zeynep   25    240
5  OpenAI         HR     Ali   38    200
6  Amazon         HR   Yusuf   30    220
7  OpenAI         IT    Elif   28    160

In [219]:
df[["Company", "Person"]].applymap(lambda x: x.upper()) # bütun satırlara tek tek işlem yaptı

  Company  Person
0  AMAZON   AHMET
1  AMAZON     ECE
2  OPENAI   FATMA
3  OPENAI  MEHMET
4  AMAZON  ZEYNEP
5  OPENAI     ALI
6  AMAZON   YUSUF
7  OPENAI    ELIF

In [222]:
df["Company"].map(lambda x: x.upper()) # map sadece Serieslerle çalışır.

0    AMAZON
1    AMAZON
2    OPENAI
3    OPENAI
4    AMAZON
5    OPENAI
6    AMAZON
7    OPENAI
Name: Company, dtype: object

In [223]:
df.Age.map(lambda x: x + 10) # bütün yaşlara 10 ekledi

0    42
1    36
2    45
3    50
4    35
5    48
6    40
7    38
Name: Age, dtype: int64